{
  "Mexican": {
    "Title": "Mexico",
    "Color": "#006847",
    "Emoji": "🌮",
    "Dishes": [
      {
        "name": "Chilaquiles",
        "image": "https://cdn7.kiwilimon.com/recetaimagen/28595/28780.jpg",
        "ingredients": "Corn tortillas, Red sauce (or green sauce), Chicken, Cheese (preferably cotija or fresco), Onion, Cilantro, Sour cream, Fried eggs (optional), Avocado (optional)",
        "recipe": "1. Cut the tortillas into small strips and fry them until crispy. 2. In a separate pan, heat the red or green sauce (depending on your preference). 3. Add the crispy tortilla strips to the sauce and cook for a few minutes until they soften. 4. Shred cooked chicken and add it to the chilaquiles, mixing it well. 5. Serve with a sprinkle of cheese, onion, cilantro, and a dollop of sour cream. Optionally, top with a fried egg and avocado slices."
      },
      {
        "name": "Tacos",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwn3PhD_2zUda2dtLYfwU2xkHl9cWFt4pvzg&s",
        "ingredients": "Corn tortillas, Choice of meat (beef, pork, chicken, or vegetarian options), Onion, Cilantro, Lime, Salsa (red or green), Hot sauce (optional)",
        "recipe": "1. Cook the meat of your choice (grill, sauté, or slow-cook until tender). 2. Heat the tortillas on a comal or skillet. 3. Once the meat is ready, slice it into small pieces or shred it (depending on the type of meat). 4. Serve the meat in the warm tortillas. 5. Top with freshly chopped onion, cilantro, a squeeze of lime, and your favorite salsa. Add hot sauce for an extra kick."
      },
      {
        "name": "Sopes",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_Sy9MCPYYuy5-JEiT_JXj4HWOaM_dsUppCQ&s",
        "ingredients": "Corn dough (masa), Refried beans, Lettuce, Sour cream, Queso fresco, Salsa, Onion (optional)",
        "recipe": "1. Make small thick tortillas from the corn masa. 2. Heat them on a griddle until lightly golden. 3. Use your fingers to pinch the edges of the tortilla, creating a small border to hold the toppings. 4. Spread a layer of refried beans over the tortilla. 5. Top with shredded lettuce, crumbled queso fresco, sour cream, and salsa. Optionally, add sliced onion for extra flavor."
      },
      {
        "name": "Enchiladas",
        "image": "https://www.recetasnestle.com.mx/sites/default/files/styles/recipe_detail_desktop/public/srh_recipes/70f19a86ba0ddc5de970281bd2c0c0aa.png?itok=oOkqPkhQ",
        "ingredients": "Corn tortillas, Chicken (shredded), Red or green enchilada sauce, Onion, Cheese (Mexican blend or cheddar), Sour cream, Fresh cilantro",
        "recipe": "1. Heat the tortillas in a pan to soften them. 2. Shred the cooked chicken and place a spoonful in the center of each tortilla. 3. Roll the tortillas around the chicken and place them in a baking dish. 4. Pour the red or green enchilada sauce over the rolled tortillas. 5. Sprinkle with cheese and bake at 350°F (175°C) for about 20 minutes or until the cheese is melted and bubbly. 6. Serve with sour cream, chopped onion, and fresh cilantro on top."
      },
      {
        "name": "Pozole",
        "image": "https://c.files.bbci.co.uk/18351/production/_126735199_69601758-e7de-4bbf-95ed-27494180e432.jpg",
        "ingredients": "Hominy corn, Pork (or chicken), Garlic, Onion, Cabbage, Radishes, Oregano, Lime, Chili powder, Mexican oregano",
        "recipe": "1. In a large pot, cook the hominy corn with pork or chicken, garlic, and onion. Simmer for several hours until the meat is tender and the flavors are well combined. 2. Prepare toppings: thinly slice cabbage, radishes, and lime. 3. Serve the pozole in bowls and garnish with cabbage, radishes, oregano, and a squeeze of lime. Optionally, add chili powder for extra spice."
      },
      {
        "name": "Tamales",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRioBdEKe-j_JE2J7iI_Xxsy889JNggk8ekwg&s",
        "ingredients": "Corn masa, Meat (pork, chicken, or vegetables), Red sauce or green sauce, Corn husks, Chicken broth, Baking powder, Salt, Lard or butter",
        "recipe": "1. Soak the corn husks in warm water to soften. 2. Prepare the masa by mixing it with chicken broth, baking powder, salt, and lard (or butter). 3. Add your choice of meat and sauce to the masa. 4. Spread a thin layer of masa on each corn husk, then fold it into a small packet. 5. Steam the tamales in a large pot for about 1-1.5 hours, or until the masa is fully cooked."
      },
      {
        "name": "Mole Poblano",
        "image": "https://www.gob.mx/cms/uploads/article/main_image/80518/mole_poblano.jpg",
        "ingredients": "Chicken, Mole sauce (pre-made or homemade), Sesame seeds, Rice (for serving)",
        "recipe": "1. Cook the chicken until tender. 2. Heat the mole sauce in a separate pot, adjusting the consistency with water or chicken broth as needed. 3. Once the chicken is cooked, pour the mole sauce over it and simmer for about 10-15 minutes. 4. Serve with a side of rice and garnish with sesame seeds."
      },
      {
        "name": "Cochinita Pibil",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTHw14aDnM3HsB1p40psw6T2dRxq5HEpavxcw&s",
        "ingredients": "Pork, Annatto paste, Citrus juice (orange and lime), Banana leaves, Garlic, Salt, Pepper",
        "recipe": "1. Marinate the pork with annatto paste, citrus juice, garlic, salt, and pepper for at least 4 hours (overnight is best). 2. Wrap the marinated pork in banana leaves and bake it in a low oven (around 300°F or 150°C) for about 3-4 hours, or until the pork is tender and shreds easily. 3. Serve with pickled red onions and warm tortillas."
      },
      {
        "name": "Tlayudas",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRsvt-3HYSy91umqYmJbUQVJQKSUFykTMXJWA&s",
        "ingredients": "Large tortillas, Oaxacan cheese, Meat (such as tasajo or cecina), Lettuce, Salsa, Avocado (optional)",
        "recipe": "1. Grill the large tortilla until crispy. 2. Top with Oaxacan cheese and cook until melted. 3. Add the meat (grilled or sautéed) and lettuce. 4. Serve with salsa and avocado if desired."
      },
      {
        "name": "Chiles en Nogada",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxzWlW5G0tpPJaheLEbBmVO15l6fN8hTPCRQ&s",
        "ingredients": "Poblano chiles, Ground meat (beef and/or pork), Fruits (apple, plantain, peach), Walnuts, Milk, Cinnamon, Pomegranate, Cilantro",
        "recipe": "1. Roast the poblano chiles and peel them. 2. Prepare the filling by cooking ground meat and adding fruits (chopped apples, plantains, and peaches). 3. Prepare the walnut sauce by blending walnuts with milk and cinnamon until smooth. 4. Stuff the chiles with the meat and fruit mixture, then cover with the walnut sauce. 5. Garnish with pomegranate seeds and cilantro."
      },
      {
        "name": "Enfrijoladas",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwSPIuu4mgeYappIfY9lNyp4wEudgJiGwsbA&s",
        "ingredients": "Corn tortillas, Black beans, Onion, Cheese, Sour cream, Salsa",
        "recipe": "1. Heat the black beans until soft and blend into a smooth sauce. 2. Dip the tortillas into the bean sauce and roll them up. 3. Serve with chopped onions, cheese, sour cream, and a drizzle of salsa."
      },
      {
        "name": "Quesadillas ",
        "image": "https://elblogdecocina.com/wp-content/uploads/quesadillas-rotated.jpg",
        "ingredients": "Corn or flour tortillas, Cheese (queso fresco, Oaxaca, or other melting cheese), Meat (optional), Salsa, Hot sauce (optional)",
        "recipe": "1. Heat a tortilla in a skillet. 2. Add cheese (and optional meat) on top. 3. Fold the tortilla in half and grill until crispy and golden. 4. Serve with salsa and hot sauce."
      },
      {
        "name": "Gorditas",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQx4azweHY4IAO9r9IwW04KwG6kssJcyzs_MA&s",
        "ingredients": "Corn masa, Cheese, Meat (optional), Salsa, Sour cream",
        "recipe": "1. Form thick tortillas from the masa. 2. Cook them on a griddle until golden. 3. Cut them in half and stuff them with cheese and meat (if desired). 4. Top with salsa and sour cream."
      },
      {
        "name": "Huaraches",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyNjWRrZhBTUpAT_Xq6i_ZEWoRswuWjHRqNA&s",
        "ingredients": "Corn masa, Refried beans, Pork (or other meat), Cactus (nopal), Salsa, Queso fresco, Onion, Cilantro",
        "recipe": "1. Prepare the masa by forming thick oval-shaped tortillas. 2. Grill the tortillas on a hot comal or griddle until lightly golden. 3. Spread refried beans on top of each tortilla. 4. Grill the pork or other meat of your choice (e.g., grilled steak or chorizo) and place it on top of the huaraches. 5. Add grilled cactus (nopal) slices and top with salsa, queso fresco, chopped onion, and cilantro. Serve warm."
      },
      {
        "name": "Pambazos",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZvJB0do5jS4TU3GC2zzNNiPo4mQTNVYJUuw&s",
        "ingredients": "Baguette-style bread, Chorizo, Potatoes, Lettuce, Sour cream, Queso fresco, Salsa",
        "recipe": "1. Cook the chorizo with diced potatoes until crispy. 2. Slice the bread and lightly toast it. 3. Dip the bread in a red sauce (made from guajillo chilies) to coat it. 4. Fill the bread with the chorizo and potato mixture. 5. Top with shredded lettuce, sour cream, queso fresco, and salsa. Serve warm."
      },
      {
        "name": "Esquites",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJEyRX8-vgoHnhxXDxB0iwJyKvtXiskgWvzQ&s",
        "ingredients": "Corn kernels, Mayonnaise, Butter, Lime, Chili powder, Queso fresco",
        "recipe": "1. Boil or grill the corn kernels until tender. 2. In a separate pan, melt butter and mix it with the corn. 3. Stir in a generous amount of mayonnaise. 4. Squeeze lime juice over the corn and add chili powder to taste. 5. Serve in cups, topped with crumbled queso fresco and more chili powder if desired."
      },
      {
        "name": "Elote",
        "image": "https://img.freepik.com/fotos-premium/retrato-comida-mexicana-elote_1293546-652.jpg",
        "ingredients": "Corn on the cob, Mayonnaise, Cotija cheese, Chili powder, Lime",
        "recipe": "1. Grill the corn on the cob until slightly charred. 2. While the corn is still warm, spread a layer of mayonnaise over it. 3. Sprinkle crumbled cotija cheese over the mayonnaise. 4. Dust with chili powder and squeeze fresh lime juice over the top. Serve immediately."
      },
      {
        "name": "Tortas",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSHUXIya8R97KjuHgLvG_ojJuY_zdxrSz1-4A&s",
        "ingredients": "Bolillo rolls, Choice of meat (beef, pork, chicken), Avocado, Lettuce, Onion, Salsa, Refried beans",
        "recipe": "1. Slice the bolillo rolls and toast them lightly. 2. Grill your meat (such as grilled beef, carnitas, or chicken) and shred or slice it. 3. Spread a layer of refried beans on one side of the roll. 4. Add the grilled meat and top with slices of avocado, lettuce, onion, and salsa. Serve with pickled jalapeños or extra hot sauce if desired."
      },
      {
        "name": "Burritos",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_Sf6Z2aXwaefbrpbuSMR5UaAnTl-BjkKO8w&s",
        "ingredients": "Flour tortillas, Rice, Beans, Choice of meat (beef, chicken, or pork), Guacamole, Salsa, Sour cream",
        "recipe": "1. Prepare rice and beans (refried or whole). 2. Cook your chosen meat (grilled chicken, beef, or pork). 3. Warm the flour tortillas on a griddle. 4. Layer the rice, beans, grilled meat, guacamole, salsa, and sour cream in the center of the tortilla. 5. Fold the tortilla into a burrito, rolling it tightly to close. Serve with extra salsa or hot sauce on the side."
      }
    ]
  },
  "Italian": {
    "Title": "Italy",
    "Emoji": "🍝",
    "Dishes": [
      "Pasta",
      "Pizza",
      "Ravioli",
      "Lasagna",
      "Spaghetti alla Carbonara",
      "Risotto",
      "Polenta",
      "Ossobuco",
      "Arancini",
      "Gnocchi",
      "Focaccia",
      "Calzone",
      "Panzanella",
      "Bruschetta",
      "Caprese Salad",
      "Tiramisu",
      "Panna Cotta",
      "Cannoli",
      "Gelato"
    ],
    "Typical_Meal_Time": "1:00 PM - 2:00 PM",
    "Popular_Ingredients": ["Wheat", "Tomatoes", "Basil"]
  },
  "Argentinian": {
    "Title": "Argentina",
    "Emoji": "🥟",
    "BackgroundColor": "#C88575",
    "Dishes": [
      {
        "Name": "Asado",
        "Image": "https://t3.ftcdn.net/jpg/00/91/21/94/240_F_91219420_atTWGlR2XlNaJf3Bk0XkOHkYl7YpGHSg.jpg",
        "Ingredients": [
          "1 beef rib rack",
          "1 flank steak",
          "1 skirt steak",
          "4 short ribs",
          "2 sausages",
          "2 blood sausages",
          "Coarse salt to taste",
          "500 grams of sweetbreads",
          "500 grams of chitterlings",
          "300 grams of kidneys",
          "Chimichurri (olive oil, wine vinegar, garlic, parsley, oregano, chili flakes, red bell pepper)",
          "Salsa criolla (1 tomato, 1 onion, 1 red bell pepper, 1 green bell pepper, oil, vinegar)",
          "Bread for choripanes"
        ],
        "Recipe": [
          "1. Light the fire with charcoal or wood (preferably quebracho or espinillo) and let it create a good bed of coals.",
          "2. While the grill heats up, season the meat with coarse salt on both sides and let it rest for a few minutes.",
          "3. When the coals are ready, place the meat on the grill, bone side down if applicable, and cook over low heat.",
          "4. Add the sweetbreads, chitterlings, and kidneys, turning them for even cooking.",
          "5. Let the meat cook for 1-2 hours, depending on the cut, until juicy and golden.",
          "6. Meanwhile, prepare the chimichurri and salsa criolla by mixing all ingredients.",
          "7. Serve the asado with the side dishes and enjoy with bread for choripanes."
        ]
      },
      {
        "Name": "Empanadas",
        "Image": "https://t4.ftcdn.net/jpg/00/43/09/27/240_F_43092790_oob8IIY4UnlCc4b0FlL0HbaqaxPQd6UH.jpg",
        "Ingredients": [
          "500 grams of ground beef (preferably shoulder or top round)",
          "2 large onions",
          "1 red bell pepper",
          "2 hard-boiled eggs",
          "100 grams of green olives (pitted)",
          "1 tablespoon of sweet paprika",
          "1 tablespoon of cumin",
          "1 teaspoon of chili flakes",
          "Salt to taste",
          "Pepper to taste",
          "1 package of empanada dough for baking (approximately 12 discs)",
          "2 tablespoons of oil (preferably beef fat or neutral oil)"
        ],
        "Recipe": [
          "1. In a large skillet, heat the oil over medium heat and add the chopped onions and diced red bell pepper. Sauté until soft.",
          "2. Add the ground beef and cook until browned and fully cooked.",
          "3. Add the paprika, cumin, chili flakes, salt, and pepper to taste. Mix well and cook for a few minutes to blend flavors.",
          "4. Remove from heat and let the mixture cool.",
          "5. Add the chopped hard-boiled eggs and sliced olives to the filling, and mix gently.",
          "6. Preheat the oven to 200°C (392°F).",
          "7. Fill each empanada disc with a spoonful of meat mixture. Moisten the edges with water, fold over, and seal with a fork or by crimping.",
          "8. Place on a baking tray and bake for 20-25 minutes until golden brown.",
          "9. Serve hot."
        ]
      },
      {
        "Name": "Milanesa",
        "Image": "https://t4.ftcdn.net/jpg/02/96/96/67/240_F_296966702_hmhZv8ggZZYQb9doi7V9eUAc97nowt4U.jpg",
        "Ingredients": [
          "500 gr White corn kernels",
          "200 gr Beans (or alubias)",
          "500 gr Flank or rib steak (churrasco in Spain)",
          "500 gr Pig's feet",
          "200 gr Smoked bacon",
          "2 Creole sausages",
          "1 Small pumpkin",
          "3 Garlic cloves",
          "2 Bay leaves",
          "1 Medium onion",
          "1 tsp Ground chili (replace with 2 crushed dried chili peppers)",
          "4 tbsp Lard (pork fat)",
          "2 tbsp Sweet paprika",
          "1/2 tsp Ground cumin",
          "Salt to taste"
        ],
        "Recipe": [
          "1. Season beef or chicken cutlets with salt and pepper.",
          "2. Dip each cutlet in beaten egg, then coat in breadcrumbs.",
          "3. Heat oil in a skillet and fry each cutlet until golden and crispy on both sides.",
          "4. Drain on paper towels and serve with lemon wedges."
        ]
      },
      {
        "Name": "Locro",
        "Image": "https://t4.ftcdn.net/jpg/08/31/50/35/240_F_831503519_4ZtCY508My6WxjlCay2PGJ6RYcjoZxpT.jpg",
        "Ingredients": [
          "250g of white beans",
          "250g of cracked white corn",
          "1 red chorizo sausage",
          "1 traditional chorizo sausage",
          "Pork skin",
          "Pork ribs",
          "Flank steak",
          "200g of bacon",
          "3 onions",
          "2 green onions",
          "1 leek",
          "1/2 pumpkin",
          "1/2 red bell pepper (for the sauce)"
        ],
        "Recipe": [
          "1. Soak corn and beans overnight.",
          "2. In a large pot, cook diced beef with chorizo until browned.",
          "3. Add corn, beans, and water, then simmer on low heat for several hours until everything is tender.",
          "4. Season with salt, pepper, and paprika."
        ]
      },
      {
        "Name": "Humitas",
        "Image": "https://t3.ftcdn.net/jpg/04/78/05/62/240_F_478056220_EAhPwWRdHz5ThLgJWmKt05LorSDCKPFv.jpg",
        "Ingredients": [
          "12 ears of corn",
          "2 green onions",
          "1 red bell pepper",
          "1 onion",
          "1 tomato",
          "1 small pumpkin",
          "Fresh herbs to taste",
          "400g of fresh cheese",
          "1 tablespoon of sugar",
          "Salt",
          "Pepper",
          "Nutmeg",
          "½ cup of olive oil"
        ],
        "Recipe": [
          "1. Mix grated corn with chopped onions, cheese, salt, and pepper.",
          "2. Spoon mixture into corn husks and fold them closed.",
          "3. Steam for about 30-40 minutes, until filling is set."
        ]
      },
      {
        "Name": "Choripan",
        "Image": "https://t4.ftcdn.net/jpg/09/06/29/61/240_F_906296184_fKIwBRdDpiKT2fgbqJeJ775gusxbORuz.jpg",
        "Ingredients": ["Sausage", "Bread", "Chimichurri"],
        "Recipe": [
          "1. Grill the sausage until fully cooked.",
          "2. Place sausage in crusty bread and add chimichurri sauce on top.",
          "3. Serve hot."
        ]
      },
      {
        "Name": "Matambre",
        "Image": "https://t4.ftcdn.net/jpg/06/14/57/63/240_F_614576395_0vk5N4oBk561KGeIxkzFDN6coTu27RmX.jpg",
        "Ingredients": ["Flank steak", "Vegetables", "Egg"],
        "Recipe": [
          "1. Cook the flank steak with vegetables and egg.",
          "2. Roll the steak tightly and tie with string.",
          "3. Boil or bake until tender, then cool, slice, and serve cold."
        ]
      },
      {
        "Name": "Provoleta",
        "Image": "https://t3.ftcdn.net/jpg/08/32/75/34/240_F_832753487_fRFOkNBjgPcNbGpiuMSpzIU8VL2LHjfF.jpg",
        "Ingredients": [
          "2 thick wheels (about 8-9 ounces each) of provolone cheese with rind",
          "4 tablespoons of extra virgin olive oil, or as needed",
          "Dried oregano, to taste",
          "Sea salt or kosher salt, to taste",
          "Freshly ground black pepper, to taste"
        ],
        "Recipe": [
          "1. Heat a grill or skillet over medium-high heat.",
          "2. Place the provolone cheese wheels on the grill or skillet.",
          "3. Cook until the cheese melts and becomes lightly golden around the edges.",
          "4. Drizzle with olive oil and sprinkle with oregano, salt, and pepper to taste.",
          "5. Serve immediately and enjoy."
        ]
      },
      {
        "Name": "Alfajores",
        "Image": "https://t4.ftcdn.net/jpg/02/57/07/09/240_F_257070999_CJV0WaywEOsCMhOoFk1a0hMoyjDC3u75.jpg",
        "Ingredients": [
          "2 cookies (for filling)",
          "Dulce de leche",
          "Shredded coconut or melted chocolate (for coating)"
        ],
        "Recipe": [
          "1. Spread dulce de leche between two cookies to form a sandwich.",
          "2. Roll the edges of the sandwich in shredded coconut or dip in melted chocolate.",
          "3. Let it chill until the coating sets, then serve."
        ]
      },
      {
        "Name": "Dulce de Leche",
        "Image": "https://t3.ftcdn.net/jpg/10/26/73/70/240_F_1026737033_UT7N668FYCZRFTwXjvkQlibUv56ndu7x.jpg",
        "Ingredients": [
          "1 liter of whole milk",
          "2 cups of sugar",
          "1/4 teaspoon of baking soda (optional, for smooth texture)"
        ],
        "Recipe": [
          "1. In a large pot, combine the milk and sugar.",
          "2. Cook over medium-low heat, stirring constantly to prevent burning.",
          "3. Continue cooking for 1.5-2 hours, until the mixture thickens and turns a caramel color.",
          "4. If desired, add baking soda towards the end of cooking to achieve a smoother consistency.",
          "5. Let it cool before using as a filling or topping."
        ]
      },
      {
        "Name": "Pastelitos",
        "Image": "https://t4.ftcdn.net/jpg/08/73/94/05/240_F_873940546_6V5uQtSyVscIIbVxXQWZcxsZJKLhOd9F.jpg",
        "Ingredients": [
          "500 grams of all-purpose flour",
          "200 grams of butter or vegetable shortening",
          "250 milliliters of water",
          "1 pinch of salt",
          "1 teaspoon of lemon juice",
          "50 grams of cornstarch",
          "300 grams of quince paste",
          "1 cup of oil",
          "½ cup of sugar (100 grams)",
          "½ cup of water (120 milliliters)",
          "Colored sprinkles for decoration"
        ],
        "Recipe": [
          "1. In a large bowl, mix the flour, butter (or shortening), salt, and lemon juice. Add water gradually and knead until a smooth dough forms.",
          "2. In a separate bowl, combine the cornstarch with a little water to create a paste, then add to the dough mixture.",
          "3. Roll out the dough on a lightly floured surface and cut into small squares.",
          "4. Place a piece of quince paste in the center of each square.",
          "5. Fold the dough over the paste and seal the edges tightly.",
          "6. Heat the oil in a deep fryer or large pot to 350°F (175°C).",
          "7. Fry the pastelitos until golden brown, then drain on paper towels.",
          "8. In a small saucepan, combine sugar and water. Heat until sugar dissolves and becomes a syrup.",
          "9. Brush the warm pastelitos with the syrup and sprinkle with colored sprinkles.",
          "10. Serve warm and enjoy!"
        ]
      },
      {
        "Name": "Facturas",
        "Image": "https://t3.ftcdn.net/jpg/10/23/92/58/240_F_1023925822_kKfXnjG4ulxeGJcGHfRhURJtGQ2nW3Le.jpg",
        "Ingredients": [
          "500 g pastry flour (El Amasadero)",
          "2 whole eggs",
          "10 g dry baker's yeast or 25 g fresh yeast",
          "80 g sugar",
          "1 pinch of salt",
          "1 teaspoon vanilla extract",
          "60 g butter at room temperature",
          "150 g warm milk"
        ],
        "Recipe": [
          "1. In a bowl, combine the warm milk and yeast. Let it sit for 5 minutes until the yeast is activated.",
          "2. In a separate large bowl, mix the flour, sugar, salt, and vanilla extract.",
          "3. Add the eggs and activated yeast mixture to the dry ingredients. Mix to form a dough.",
          "4. Knead the dough for about 10 minutes until it becomes smooth and elastic.",
          "5. Add the butter and continue kneading until fully incorporated.",
          "6. Cover the dough with a cloth and let it rise for about 1-2 hours, or until doubled in size.",
          "7. Preheat the oven to 180°C (350°F).",
          "8. Once the dough has risen, punch it down and divide it into small portions. Shape into your desired forms (like small buns or twists).",
          "9. Place the shaped dough on a baking sheet lined with parchment paper.",
          "10. Bake for about 15-20 minutes, or until golden brown.",
          "11. Let cool slightly, then serve. Optionally, you can dust with powdered sugar or drizzle with icing."
        ]
      }
    ],

    "Typical_Meal_Time": "9:00 PM - 11:00 PM",
    "Popular_Ingredients": ["Beef", "Wheat", "Garlic"]
  },
  "UnitedStatian": {
    "Title": "United States",
    "Emoji": "🍔🍟",
    "Dishes": [
      {
        "Name": "Hamburger",
        "Image": "https://as1.ftcdn.net/v2/jpg/04/96/36/70/1000_F_496367019_IygW7s5qS3Fiu1UNY8Dl5LrGlGfSsH3Z.jpg",
        "Ingredients": [
          "Ground beef",
          "Salt",
          "Pepper",
          "Hamburger bun",
          "Lettuce",
          "Tomato",
          "Onion",
          "Cheese"
        ],
        "Recipe": [
          "1. Mix ground beef with salt and pepper to taste.",
          "2. Shape the mixture into a burger patty.",
          "3. Cook the burger in a skillet or on a grill over medium-high heat until the desired level of doneness.",
          "4. Serve the burger on a hamburger bun with your favorite toppings (lettuce, tomato, onion, cheese, etc.)."
        ]
      },
      {
        "Name": "Fries",
        "Image": "https://as2.ftcdn.net/v2/jpg/09/85/39/19/1000_F_985391943_FwbSIHJ65fqsXEsameMY4QTBxta0rjMs.jpg",
        "Ingredients": ["Potatoes", "Oil", "Salt"],
        "Recipe": [
          "1. Peel and cut the potatoes into evenly sized strips.",
          "2. Heat oil in a skillet or deep fryer to 180°C.",
          "3. Fry the potatoes in the hot oil until golden and crispy.",
          "4. Drain the fries on paper towels and season with salt to taste."
        ]
      },
      {
        "Name": "Pizza",
        "Image": "https://as1.ftcdn.net/v2/jpg/09/98/12/72/1000_F_998127221_yeCYd6PSVogCPGCKjmsR9Sngsy5OYPQC.jpg",
        "Ingredients": [
          "Pizza dough",
          "Tomato sauce",
          "Mozzarella cheese",
          "Pepperoni",
          "Ham",
          "Mushrooms"
        ],
        "Recipe": [
          "1. Preheat the oven to 220°C.",
          "2. Roll out the pizza dough on a floured flat surface.",
          "3. Top the dough with tomato sauce, mozzarella cheese, and other toppings like pepperoni, ham, or mushrooms.",
          "4. Place the pizza in the oven and bake for 12-15 minutes or until the cheese is melted and the crust is golden."
        ]
      },
      {
        "Name": "Hot Dog",
        "Image": "https://as2.ftcdn.net/v2/jpg/08/49/44/13/1000_F_849441346_FSOKIXhzAtUy5PNaG320hWY48zD8hHLg.jpg",
        "Ingredients": [
          "Sausages",
          "Hot dog bun",
          "Mustard",
          "Ketchup",
          "Onions"
        ],
        "Recipe": [
          "1. Cook the sausages in hot water or on a grill.",
          "2. Place the cooked sausages inside a hot dog bun.",
          "3. Add mustard, ketchup, onions, or any other sauce or condiment of your choice."
        ]
      },
      {
        "Name": "Cheeseburger",
        "Image": "https://as1.ftcdn.net/v2/jpg/05/60/62/88/1000_F_560628815_qN06tWO54ejWiFs9f9zykPmfCnjjkC0g.jpg",
        "Ingredients": [
          "Ground beef",
          "Salt",
          "Pepper",
          "Cheddar cheese",
          "Hamburger bun",
          "Lettuce",
          "Tomato",
          "Onion",
          "Condiments"
        ],
        "Recipe": [
          "1. Shape ground beef into a patty and season with salt and pepper.",
          "2. Cook the burger in a skillet or on a grill over medium-high heat.",
          "3. Add a slice of cheddar cheese on top of the meat when it is almost done, allowing it to melt.",
          "4. Serve the burger on a hamburger bun with lettuce, tomato, onion, and your choice of condiments."
        ]
      },
      {
        "Name": "Mac and Cheese",
        "Image": "https://as1.ftcdn.net/v2/jpg/09/34/92/50/1000_F_934925060_4E6VfLwRM0O7u4fC3KNiTSVlqUXPywvg.jpg",
        "Ingredients": [
          "Pasta",
          "Butter",
          "Flour",
          "Milk",
          "Cheddar cheese",
          "Salt",
          "Pepper"
        ],
        "Recipe": [
          "1. Cook the pasta according to the package instructions.",
          "2. Meanwhile, melt butter in a large skillet and add flour to make a roux.",
          "3. Gradually add milk to the skillet, whisking constantly until the sauce thickens.",
          "4. Stir in shredded cheddar cheese and mix until melted.",
          "5. Add the cooked pasta and mix well until it is fully coated with the cheese sauce."
        ]
      },
      {
        "Name": "Fried Chicken",
        "Image": "https://as2.ftcdn.net/v2/jpg/09/90/10/83/1000_F_990108300_qKWLKusox3oe3mED8Wko8COxRSGk1lu7.jpg",
        "Ingredients": [
          "Chicken pieces",
          "Salt",
          "Pepper",
          "Spices",
          "Flour",
          "Oil"
        ],
        "Recipe": [
          "1. Season chicken pieces with salt, pepper, and other spices to taste.",
          "2. Dredge the chicken in seasoned flour, ensuring it is well-coated.",
          "3. Heat oil in a deep skillet to 180°C.",
          "4. Fry the chicken in the hot oil until golden and crispy on the outside and cooked through on the inside.",
          "5. Drain the chicken on paper towels before serving."
        ]
      },
      {
        "Name": "Pancakes",
        "Image": "https://as1.ftcdn.net/v2/jpg/08/28/75/70/1000_F_828757015_5nZi7cXoK0h4MrzQOjginYgtCkNpBjX2.jpg",
        "Ingredients": [
          "Flour",
          "Baking powder",
          "Sugar",
          "Milk",
          "Egg",
          "Butter",
          "Maple syrup",
          "Fruit",
          "Whipped cream"
        ],
        "Recipe": [
          "1. In a bowl, mix flour, baking powder, sugar, milk, egg, and melted butter until smooth.",
          "2. Heat a non-stick skillet over medium heat and grease it with a little butter or oil.",
          "3. Pour small amounts of batter onto the hot skillet.",
          "4. Cook each pancake until bubbles appear on the surface, then flip and cook the other side until golden.",
          "5. Serve with maple syrup, fruit, or whipped cream."
        ]
      },
      {
        "Name": "Waffles",
        "Image": "https://as2.ftcdn.net/v2/jpg/10/04/01/19/1000_F_1004011956_7YROotlMIO65WSWcwH0iFh4LvJO4PqhZ.jpg",
        "Ingredients": [
          "Flour",
          "Baking powder",
          "Sugar",
          "Egg",
          "Milk",
          "Butter",
          "Maple syrup",
          "Fruit",
          "Whipped cream"
        ],
        "Recipe": [
          "1. Mix flour, baking powder, sugar, egg, milk, and melted butter in a bowl until smooth.",
          "2. Preheat a waffle iron and grease it with a little oil or butter.",
          "3. Pour the batter into the waffle iron and cook according to the device's instructions, until the waffles are golden and crispy.",
          "4. Serve with fruit, maple syrup, or whipped cream."
        ]
      },
      {
        "Name": "Donuts",
        "Image": "https://as1.ftcdn.net/v2/jpg/08/15/53/20/1000_F_815532071_N11sYAvOBTKTStiO6mlPVf7hrJ8pX2zQ.jpg",
        "Ingredients": [
          "Flour",
          "Sugar",
          "Yeast",
          "Warm milk",
          "Egg",
          "Butter",
          "Glaze",
          "Powdered sugar"
        ],
        "Recipe": [
          "1. Mix flour, sugar, yeast, warm milk, egg, and melted butter in a bowl.",
          "2. Knead until smooth and let the dough rise for 1 hour.",
          "3. Roll out the dough and cut it with a donut cutter.",
          "4. Fry the donuts in hot oil until golden on the outside."
        ]
      }
    ],
    "Typical_Meal_Time": "6:00 PM - 8:00 PM",
    "Popular_Ingredients": [
      "Ground beef",
      "Potatoes",
      "Mozzarella cheese",
      "Tomato sauce",
      "Hamburger bun",
      "Sausages",
      "Flour",
      "Milk",
      "Egg",
      "Butter",
      "Sugar",
      "Baking powder",
      "Cream",
      "Vanilla",
      "Chocolate chips",
      "Cocoa powder",
      "Apples",
      "Clams",
      "Lobster",
      "Barbecue sauce",
      "Potatoes",
      "Onion",
      "Tomato",
      "Chives",
      "Paprika",
      "Salt",
      "Pepper",
      "Oil"
    ]
  },
  "Japanesse": {
    "Title": "Japan",
    "Emoji": "🍣",
    "Dishes": [
      "Sushi",
      "Ramen",
      "Tempura",
      "Udon",
      "Soba",
      "Miso Soup",
      "Onigiri",
      "Yakitori",
      "Gyoza",
      "Tonkatsu",
      "Teriyaki",
      "Sashimi",
      "Mochi",
      "Dorayaki",
      "Taiyaki",
      "Oden",
      "Shabu-shabu",
      "Sukiyaki"
    ],
    "Typical_Meal_Time": "12:00 PM - 1:00 PM",
    "Popular_Ingredients": ["Rice", "Fish", "Soy Sauce"]
  },
  "French": {
    "Title": "France",
    "Emoji": "🫕",
    "Dishes": [
      "Croissant",
      "Baguette",
      "Macaron",
      "Crème brûlée",
      "Soupe à l'oignon gratinée",
      "Boeuf bourguignon",
      "Coq au vin",
      "Ratatouille",
      "Cassoulet",
      "Crêpes",
      "Pain au chocolat",
      "Tarte Tatin",
      "Éclair",
      "Mille-feuille",
      "Quiche Lorraine",
      "Gratin Dauphinois",
      "Steak Frites",
      "Foie gras"
    ],
    "Typical_Meal_Time": "12:00 PM - 2:00 PM",
    "Popular_Ingredients": ["Wheat", "Butter", "Cheese"]
  },
  "Spanish": {
    "Title": "Spain",
    "Emoji": "🥘",
    "Dishes": [
      "Arroz",
      "Tortilla Española",
      "Gazpacho",
      "Jamón Ibérico",
      "Chorizo",
      "Churros",
      "Cocido Madrileño",
      "Fabada Asturiana",
      "Pulpo a la Gallega",
      "Gambas al Ajillo"
    ],
    "Typical_Meal_Time": "2:00 PM - 3:00 PM",
    "Popular_Ingredients": ["Olive Oil", "Garlic", "Saffron"]
  },
  "Indian": {
    "Title": "India",
    "Emoji": "🍛",
    "Dishes": [
      "Chicken Tikka Masala",
      "Naan Bread",
      "Samosas",
      "Biryani",
      "Butter Chicken",
      "Tandoori Chicken",
      "Palak Paneer",
      "Dal Makhani",
      "Chana Masala",
      "Vada Pav"
    ],
    "Typical_Meal_Time": "1:00 PM - 2:00 PM",
    "Popular_Ingredients": ["Spices", "Rice", "Lentils"]
  },
  "Chinese": {
    "Title": "China",
    "Emoji": "🍜",
    "Dishes": [
      {
        "name": "Peking Duck",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQrC6vLZVLLcFx8jEvmmb7x7GEEcUCazICC3w&s",
        "ingredients": "Duck, Hoisin sauce, Scallions, Cucumbers, Chinese pancakes",
        "recipe": "1. Marinate the duck with spices and hoisin sauce. 2. Roast the duck in the oven until the skin is crispy. 3. Slice the duck and serve with pancakes, hoisin sauce, scallions, and cucumber slices. 4. Wrap each slice of duck with sauce and vegetables in a pancake."
      },
      {
        "name": "Dim Sum",
        "image": "https://www.cocinista.es/download/bancorecursos/recetas/receta-dim-sum-que-es-como-se-hace.jpg",
        "ingredients": "Wonton wrappers, Shrimp, Pork, Ginger, Soy sauce, Green onions",
        "recipe": "1. Mix ground pork, shrimp, ginger, soy sauce, and green onions. 2. Place a small amount of filling in each wonton wrapper and seal. 3. Steam the dim sum for about 10 minutes. 4. Serve with soy sauce or chili oil on the side."
      },
      {
        "name": "Noodles",
        "image": "https://cdn7.kiwilimon.com/recetaimagen/40579/640x640/54173.jpg.webp",
        "ingredients": "Egg noodles, Soy sauce, Ginger, Garlic, Green onions, Sesame oil, Vegetables (optional)",
        "recipe": "1. Boil the noodles until tender and drain. 2. In a pan, sauté ginger, garlic, and green onions in sesame oil. 3. Add the noodles and soy sauce to the pan and stir-fry. 4. Optionally, add vegetables like bell peppers or broccoli. Serve hot."
      },
      {
        "name": "Fried Rice",
        "image": "https://www.savoryexperiments.com/wp-content/uploads/2022/11/Fried-Rice-9-500x500.jpg",
        "ingredients": "Cooked rice, Soy sauce, Egg, Green onions, Peas, Carrots, Garlic",
        "recipe": "1. In a pan, scramble the egg and set aside. 2. Sauté garlic, peas, carrots, and green onions. 3. Add the rice to the pan and stir-fry with soy sauce. 4. Mix in the scrambled egg and serve hot."
      },
      {
        "name": "Spring Rolls",
        "image": "https://zenaskitchen.com/wp-content/uploads/2022/02/Pork-Vegetable-Spring-Rolls-540x540.jpg",
        "ingredients": "Spring roll wrappers, Cabbage, Carrots, Bamboo shoots, Soy sauce, Ground pork (optional)",
        "recipe": "1. In a pan, cook ground pork if using, then add cabbage, carrots, and bamboo shoots. 2. Add soy sauce and cook until vegetables are tender. 3. Place filling in spring roll wrappers, roll tightly, and seal. 4. Fry in oil until crispy and golden. Serve with dipping sauce."
      },
      {
        "name": "Dumplings",
        "image": "https://www.cocinista.es/download/bancorecursos/recetas/receta-masa-dumplings-chinos.jpg",
        "ingredients": "Dumpling wrappers, Ground pork, Ginger, Garlic, Soy sauce, Green onions",
        "recipe": "1. Combine ground pork, ginger, garlic, soy sauce, and green onions. 2. Place a small amount of filling in each dumpling wrapper and seal tightly. 3. Steam or boil the dumplings until cooked through. Serve with soy sauce or vinegar."
      },
      {
        "name": "Sweet and Sour Pork",
        "image": "https://www.recipetineats.com/tachyon/2020/08/Sweet-and-Sour-Pork_7-SQ.jpg",
        "ingredients": "Pork, Bell peppers, Pineapple, Onion, Vinegar, Sugar, Ketchup",
        "recipe": "1. Cut pork into pieces and fry until crispy. 2. In a pan, mix vinegar, sugar, and ketchup to make the sweet and sour sauce. 3. Add bell peppers, onions, and pineapple to the pan and stir-fry. 4. Toss the fried pork in the sauce and serve hot."
      },
      {
        "name": "Kung Pao Chicken",
        "image": "https://www.kitchensanctuary.com/wp-content/uploads/2019/10/Kung-Pao-Chicken-square-FS-39-new.jpg",
        "ingredients": "Chicken, Bell peppers, Peanuts, Chili peppers, Garlic, Soy sauce, Vinegar",
        "recipe": "1. Marinate chicken in soy sauce and vinegar. 2. Stir-fry chili peppers and garlic in a pan, then add chicken and cook until browned. 3. Add bell peppers and peanuts, stir-fry until everything is well combined. Serve hot."
      },
      {
        "name": "Mapo Tofu",
        "image": "https://omnivorescookbook.com/wp-content/uploads/2022/05/220510_Mapo-Tofu_550.jpg",
        "ingredients": "Tofu, Ground pork, Garlic, Ginger, Chili bean paste, Soy sauce, Green onions",
        "recipe": "1. Sauté garlic and ginger in a pan. 2. Add ground pork and cook until browned. 3. Add chili bean paste and soy sauce, then gently fold in tofu cubes. 4. Simmer until flavors are combined. Garnish with green onions and serve."
      },
      {
        "name": "Chow Mein",
        "image": "https://cdn7.kiwilimon.com/recetaimagen/28595/28780.jpg",
        "ingredients": "Egg noodles, Bell peppers, Carrots, Green onions, Soy sauce, Garlic, Sesame oil",
        "recipe": "1. Boil noodles until just tender, then drain. 2. Stir-fry garlic, bell peppers, carrots, and green onions in sesame oil. 3. Add the noodles and soy sauce to the pan, stir-frying until combined. Serve hot."
      }
    ]
  },
  "Greek": {
    "Title": "Greece",
    "Emoji": "🥗",
    "Dishes": [
      "Moussaka",
      "Gyros",
      "Souvlaki",
      "Greek Salad",
      "Tzatziki",
      "Dolmades",
      "Spanakopita",
      "Baklava",
      "Loukoumades"
    ],
    "Typical_Meal_Time": "2:00 PM - 3:00 PM",
    "Popular_Ingredients": ["Olive Oil", "Lemon", "Oregano"]
  }
}
